sys-admin/packaging-system.org
#+TITLE: 包管理系统－工具以及基本原理
#+AUTHOR: Cauchy(pqy7172@gmail.com)
#+EMAIL: pqy7172@gmail.com
#+HTML_HEAD: <link rel="stylesheet" href="../org-manual.css" type="text/css">

本文章介绍二进制包（binary）和源码包（source）的结构和内容．前者是直接由dpkg处理的文件，而后者包含源代码，以及一些说明指明如何构建二进制包．

* 二进制包的结构

使用命令ar可以查看一个.deb包的内容：

#+begin_example
.../sawfish$ ar t sawfish-merlin-ugliness_1.3.1-1_all.deb                                                                                                                                                                                       
debian-binary                                                                                                                                                                                                                                   
control.tar.gz                                                                                                                                                                                                                                  
data.tar.gz                                                                                                                                                                                                                                     
.../sawfish$ ar x sawfish-merlin-ugliness_1.3.1-1_all.deb                                                                                                                                                                                       
.../sawfish$ ls                                                                                                                                                                                                                                 
control.tar.gz  data.tar.gz  debian-binary  sawfish-merlin-ugliness_1.3.1-1_all.deb                                                                                                                                                             
.../sawfish$ tar -ztvf data.tar.gz |head -n 10                                                                                                                                                                                                  
drwxr-xr-x root/root         0 2004-07-28 21:28 ./                                                                                                                                                                                              
drwxr-xr-x root/root         0 2004-07-28 21:28 ./usr/                                                                                                                                                                                          
drwxr-xr-x root/root         0 2004-07-28 21:28 ./usr/share/                                                                                                                                                                                    
drwxr-xr-x root/root         0 2004-07-28 21:28 ./usr/share/sawfish/                                                                                                                                                                            
drwxr-xr-x root/root         0 2004-07-28 21:28 ./usr/share/sawfish/site-lisp/                                                                                                                                                                  
drwxr-xr-x root/root         0 2004-07-28 21:28 ./usr/share/sawfish/site-lisp/merlin/                                                                                                                                                           
-rw-r--r-- root/root      6515 2004-07-28 21:28 ./usr/share/sawfish/site-lisp/merlin/uglicon.jl                                                                                                                                                 
-rw-r--r-- root/root     15444 2004-07-28 21:28 ./usr/share/sawfish/site-lisp/merlin/ugliness.jl                                                                                                                                                
-rw-r--r-- root/root      7499 2004-07-28 21:28 ./usr/share/sawfish/site-lisp/merlin/message.jl                                                                                                                                                 
-rw-r--r-- root/root      5033 2004-07-28 21:28 ./usr/share/sawfish/site-lisp/merlin/util.jl                                                                                                                                                    
.../sawfish$ tar -ztvf control.tar.gz                                                                                                                                                                                                           
drwxr-xr-x root/root         0 2004-07-28 21:28 ./                                                                                                                                                                                              
-rwxr-xr-x root/root       270 2004-07-28 21:28 ./postinst                                                                                                                                                                                      
-rw-r--r-- root/root        41 2004-07-28 21:28 ./conffiles                                                                                                                                                                                     
-rw-r--r-- root/root       737 2004-07-28 21:28 ./md5sums                                                                                                                                                                                       
-rw-r--r-- root/root       471 2004-07-28 21:28 ./control                                                                                                                                                                                       
.../sawfish$ cat debian-binary                                                                                                                                                                                                                  
2.0
#+end_example

如图可以看到，一个debian包的ar压缩包由三个文件组成：

*debian-binary* 这是一个文本文件，仅用于表明.deb文件的版本．在debian buster时，为2.0．

*control.tar.xz* 包含一些元信息，比如包的名字和版本，以及一些脚本，用来在安装之前，安装的过程中，安装后执行．某些元信息提供给包管理工具用来确定安装或卸载是否可以进行．

*data.tar.xz，data.tar.bz2，data.tar.gz* 这是从压缩包里要提取的文件了，包括可执行文件，库，文档等．可以使用不同的压缩格式．

* 包元信息

* 源代码的结构
* 用dpkg操作包
